## Plan Result (sbox_landing)




<pre><code>Plan: 32 to add, 54 to change, 0 to destroy.</code></pre>

* Create
  * module.data_landing_zone[&#34;00&#34;].azurerm_role_assignment.datafactory_storage[&#34;curated&#34;]
  * module.data_landing_zone[&#34;00&#34;].azurerm_role_assignment.datafactory_storage[&#34;raw&#34;]
  * module.data_landing_zone[&#34;00&#34;].azurerm_storage_data_lake_gen2_filesystem.this[&#34;curated&#34;]
  * module.data_landing_zone[&#34;00&#34;].azurerm_storage_data_lake_gen2_filesystem.this[&#34;external&#34;]
  * module.data_landing_zone[&#34;00&#34;].azurerm_storage_data_lake_gen2_filesystem.this[&#34;raw&#34;]
  * module.data_landing_zone[&#34;00&#34;].azurerm_storage_data_lake_gen2_filesystem.this[&#34;workspace&#34;]
  * module.data_landing_zone[&#34;00&#34;].azurerm_storage_management_policy.this[&#34;curated&#34;]
  * module.data_landing_zone[&#34;00&#34;].azurerm_storage_management_policy.this[&#34;external&#34;]
  * module.data_landing_zone[&#34;00&#34;].azurerm_storage_management_policy.this[&#34;raw&#34;]
  * module.data_landing_zone[&#34;00&#34;].azurerm_storage_management_policy.this[&#34;workspace&#34;]
  * module.data_landing_zone[&#34;00&#34;].azurerm_synapse_workspace.example
  * module.data_landing_zone[&#34;00&#34;].module.shared_integration_datafactory.azurerm_data_factory_linked_service_azure_blob_storage.this[&#34;ingest00curatedsbox&#34;]
  * module.data_landing_zone[&#34;00&#34;].module.shared_integration_datafactory.azurerm_data_factory_linked_service_azure_blob_storage.this[&#34;ingest00rawsbox&#34;]
  * module.data_landing_zone[&#34;00&#34;].module.storage[&#34;curated&#34;].azurerm_storage_container.container[&#34;data&#34;]
  * module.data_landing_zone[&#34;00&#34;].module.storage[&#34;curated&#34;].azurerm_storage_container.container[&#34;di001&#34;]
  * module.data_landing_zone[&#34;00&#34;].module.storage[&#34;curated&#34;].azurerm_storage_container.container[&#34;di002&#34;]
  * module.data_landing_zone[&#34;00&#34;].module.storage[&#34;external&#34;].azurerm_storage_container.container[&#34;data&#34;]
  * module.data_landing_zone[&#34;00&#34;].module.storage[&#34;raw&#34;].azurerm_storage_container.container[&#34;data&#34;]
  * module.data_landing_zone[&#34;00&#34;].module.storage[&#34;raw&#34;].azurerm_storage_container.container[&#34;di001&#34;]
  * module.data_landing_zone[&#34;00&#34;].module.storage[&#34;raw&#34;].azurerm_storage_container.container[&#34;di002&#34;]
  * module.data_landing_zone[&#34;00&#34;].module.storage[&#34;workspace&#34;].azurerm_storage_container.container[&#34;data&#34;]
  * module.data_landing_zone[&#34;00&#34;].module.storage[&#34;workspace&#34;].azurerm_storage_container.container[&#34;dp001&#34;]
  * module.data_landing_zone[&#34;00&#34;].module.storage[&#34;workspace&#34;].azurerm_storage_container.container[&#34;dp002&#34;]
  * module.data_landing_zone[&#34;00&#34;].module.storage_pe[&#34;curated-blob&#34;].azurerm_private_endpoint.this
  * module.data_landing_zone[&#34;00&#34;].module.storage_pe[&#34;curated-dfs&#34;].azurerm_private_endpoint.this
  * module.data_landing_zone[&#34;00&#34;].module.storage_pe[&#34;external-blob&#34;].azurerm_private_endpoint.this
  * module.data_landing_zone[&#34;00&#34;].module.storage_pe[&#34;external-dfs&#34;].azurerm_private_endpoint.this
  * module.data_landing_zone[&#34;00&#34;].module.storage_pe[&#34;raw-blob&#34;].azurerm_private_endpoint.this
  * module.data_landing_zone[&#34;00&#34;].module.storage_pe[&#34;raw-dfs&#34;].azurerm_private_endpoint.this
  * module.data_landing_zone[&#34;00&#34;].module.storage_pe[&#34;workspace-blob&#34;].azurerm_private_endpoint.this
  * module.data_landing_zone[&#34;00&#34;].module.storage_pe[&#34;workspace-dfs&#34;].azurerm_private_endpoint.this
  * module.data_landing_zone[&#34;00&#34;].module.shir001.module.shir_vmss.azurerm_windows_virtual_machine_scale_set.windows_scale_set[0]
* Update
  * module.data_landing_zone[&#34;00&#34;].azurerm_eventhub_namespace.this
  * module.data_landing_zone[&#34;00&#34;].azurerm_log_analytics_workspace.this
  * module.data_landing_zone[&#34;00&#34;].azurerm_private_dns_zone_virtual_network_link.data_landing_link[&#34;privatelink.blob.core.windows.net&#34;]
  * module.data_landing_zone[&#34;00&#34;].azurerm_private_dns_zone_virtual_network_link.data_landing_link[&#34;privatelink.dfs.core.windows.net&#34;]
  * module.data_landing_zone[&#34;00&#34;].azurerm_private_dns_zone_virtual_network_link.data_landing_link[&#34;privatelink.mysql.database.azure.com&#34;]
  * module.data_landing_zone[&#34;00&#34;].azurerm_private_dns_zone_virtual_network_link.data_landing_link[&#34;privatelink.vaultcore.azure.net&#34;]
  * module.data_landing_zone[&#34;00&#34;].azurerm_resource_group.this[&#34;di001&#34;]
  * module.data_landing_zone[&#34;00&#34;].azurerm_resource_group.this[&#34;di002&#34;]
  * module.data_landing_zone[&#34;00&#34;].azurerm_resource_group.this[&#34;dp001&#34;]
  * module.data_landing_zone[&#34;00&#34;].azurerm_resource_group.this[&#34;dp002&#34;]
  * module.data_landing_zone[&#34;00&#34;].azurerm_resource_group.this[&#34;external-storage&#34;]
  * module.data_landing_zone[&#34;00&#34;].azurerm_resource_group.this[&#34;logging&#34;]
  * module.data_landing_zone[&#34;00&#34;].azurerm_resource_group.this[&#34;management&#34;]
  * module.data_landing_zone[&#34;00&#34;].azurerm_resource_group.this[&#34;metadata&#34;]
  * module.data_landing_zone[&#34;00&#34;].azurerm_resource_group.this[&#34;network&#34;]
  * module.data_landing_zone[&#34;00&#34;].azurerm_resource_group.this[&#34;runtimes&#34;]
  * module.data_landing_zone[&#34;00&#34;].azurerm_resource_group.this[&#34;shared-integration&#34;]
  * module.data_landing_zone[&#34;00&#34;].azurerm_resource_group.this[&#34;shared-product&#34;]
  * module.data_landing_zone[&#34;00&#34;].azurerm_resource_group.this[&#34;storage&#34;]
  * module.data_landing_zone[&#34;00&#34;].module.logging_vault.azurerm_key_vault.kv
  * module.data_landing_zone[&#34;00&#34;].module.logging_vault.azurerm_monitor_diagnostic_setting.kv-ds
  * module.data_landing_zone[&#34;00&#34;].module.logging_vault_pe.azurerm_private_endpoint.this
  * module.data_landing_zone[&#34;00&#34;].module.metadata_mssql.azurerm_mssql_database.this[&#34;ingest00-metadata-db-sbox&#34;]
  * module.data_landing_zone[&#34;00&#34;].module.metadata_mssql.azurerm_mssql_server.this
  * module.data_landing_zone[&#34;00&#34;].module.metadata_mssql.azurerm_private_endpoint.metadata_mssql_pe[0]
  * module.data_landing_zone[&#34;00&#34;].module.metadata_mysql.azurerm_mysql_flexible_server.this
  * module.data_landing_zone[&#34;00&#34;].module.metadata_vault[&#34;meta001&#34;].azurerm_key_vault.kv
  * module.data_landing_zone[&#34;00&#34;].module.metadata_vault[&#34;meta001&#34;].azurerm_monitor_diagnostic_setting.kv-ds
  * module.data_landing_zone[&#34;00&#34;].module.metadata_vault[&#34;meta002&#34;].azurerm_key_vault.kv
  * module.data_landing_zone[&#34;00&#34;].module.metadata_vault[&#34;meta002&#34;].azurerm_monitor_diagnostic_setting.kv-ds
  * module.data_landing_zone[&#34;00&#34;].module.metadata_vault_pe[&#34;meta001&#34;].azurerm_private_endpoint.this
  * module.data_landing_zone[&#34;00&#34;].module.metadata_vault_pe[&#34;meta002&#34;].azurerm_private_endpoint.this
  * module.data_landing_zone[&#34;00&#34;].module.networking.azurerm_network_security_group.this[&#34;nsg&#34;]
  * module.data_landing_zone[&#34;00&#34;].module.networking.azurerm_route_table.this[&#34;rt&#34;]
  * module.data_landing_zone[&#34;00&#34;].module.networking.azurerm_subnet.this[&#34;vnet-data-bricks-private&#34;]
  * module.data_landing_zone[&#34;00&#34;].module.networking.azurerm_subnet.this[&#34;vnet-data-bricks-product-private&#34;]
  * module.data_landing_zone[&#34;00&#34;].module.networking.azurerm_subnet.this[&#34;vnet-data-bricks-product-public&#34;]
  * module.data_landing_zone[&#34;00&#34;].module.networking.azurerm_subnet.this[&#34;vnet-data-bricks-public&#34;]
  * module.data_landing_zone[&#34;00&#34;].module.networking.azurerm_virtual_network.this[&#34;vnet&#34;]
  * module.data_landing_zone[&#34;00&#34;].module.runtimes_datafactory.azurerm_data_factory.this
  * module.data_landing_zone[&#34;00&#34;].module.runtimes_datafactory.azurerm_private_endpoint.this[&#34;dataFactory&#34;]
  * module.data_landing_zone[&#34;00&#34;].module.runtimes_datafactory.azurerm_private_endpoint.this[&#34;portal&#34;]
  * module.data_landing_zone[&#34;00&#34;].module.shared_integration_databricks.azurerm_databricks_workspace.this
  * module.data_landing_zone[&#34;00&#34;].module.shared_integration_datafactory.azurerm_data_factory.this
  * module.data_landing_zone[&#34;00&#34;].module.shared_integration_datafactory.azurerm_data_factory_linked_service_azure_databricks.this[&#34;ingest00-integration-databricks001-sbox&#34;]
  * module.data_landing_zone[&#34;00&#34;].module.shared_integration_datafactory.azurerm_private_endpoint.this[&#34;dataFactory&#34;]
  * module.data_landing_zone[&#34;00&#34;].module.shared_integration_datafactory.azurerm_private_endpoint.this[&#34;portal&#34;]
  * module.data_landing_zone[&#34;00&#34;].module.shared_integration_eventhub_pe.azurerm_private_endpoint.this
  * module.data_landing_zone[&#34;00&#34;].module.shared_product_databricks.azurerm_databricks_workspace.this
  * module.data_landing_zone[&#34;00&#34;].module.shir001.azurerm_lb.shir_lb
  * module.data_landing_zone[&#34;00&#34;].module.storage[&#34;curated&#34;].azurerm_storage_account.storage_account
  * module.data_landing_zone[&#34;00&#34;].module.storage[&#34;external&#34;].azurerm_storage_account.storage_account
  * module.data_landing_zone[&#34;00&#34;].module.storage[&#34;raw&#34;].azurerm_storage_account.storage_account
  * module.data_landing_zone[&#34;00&#34;].module.storage[&#34;workspace&#34;].azurerm_storage_account.storage_account




<details><summary>Change Result (Click me)</summary>

```hcl

  # module.data_landing_zone["00"].azurerm_eventhub_namespace.this will be updated in-place
  ~ resource "azurerm_eventhub_namespace" "this" {
        id                                  = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/ingest00-shared-integration-sbox/providers/Microsoft.EventHub/namespaces/ingest00-integration-eventHubNamespace001-sbox"
        name                                = "ingest00-integration-eventHubNamespace001-sbox"
      ~ tags                                = {
          - "application"  = "dlrm-data-ingest"
          - "builtFrom"    = "hmcts/dlrm-data-ingest-infra"
          - "businessArea" = "cross-cutting"
          - "criticality"  = "Low"
          - "environment"  = "sandbox"
          - "expiresAfter" = "2023-11-09"
        } -> (known after apply)
        # (15 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.data_landing_zone["00"].azurerm_log_analytics_workspace.this will be updated in-place
  ~ resource "azurerm_log_analytics_workspace" "this" {
        id                              = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/ingest00-logging-sbox/providers/Microsoft.OperationalInsights/workspaces/ingest00-logAnalytics001-sbox"
        name                            = "ingest00-logAnalytics001-sbox"
      ~ tags                            = {
          - "application"  = "dlrm-data-ingest"
          - "builtFrom"    = "hmcts/dlrm-data-ingest-infra"
          - "businessArea" = "cross-cutting"
          - "criticality"  = "Low"
          - "environment"  = "sandbox"
          - "expiresAfter" = "2023-11-09"
        } -> (known after apply)
        # (13 unchanged attributes hidden)
    }

  # module.data_landing_zone["00"].azurerm_private_dns_zone_virtual_network_link.data_landing_link["privatelink.blob.core.windows.net"] will be updated in-place
  ~ resource "azurerm_private_dns_zone_virtual_network_link" "data_landing_link" {
        id                    = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/core-infra-intsvc-rg/providers/Microsoft.Network/privateDnsZones/privatelink.blob.core.windows.net/virtualNetworkLinks/ingest00-blob-data-landing-link-sbox"
        name                  = "ingest00-blob-data-landing-link-sbox"
      ~ tags                  = {
          - "application"  = "dlrm-data-ingest"
          - "builtFrom"    = "hmcts/dlrm-data-ingest-infra"
          - "businessArea" = "cross-cutting"
          - "criticality"  = "Low"
          - "environment"  = "sandbox"
          - "expiresAfter" = "2023-11-09"
        } -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # module.data_landing_zone["00"].azurerm_private_dns_zone_virtual_network_link.data_landing_link["privatelink.dfs.core.windows.net"] will be updated in-place
  ~ resource "azurerm_private_dns_zone_virtual_network_link" "data_landing_link" {
        id                    = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/core-infra-intsvc-rg/providers/Microsoft.Network/privateDnsZones/privatelink.dfs.core.windows.net/virtualNetworkLinks/ingest00-dfs-data-landing-link-sbox"
        name                  = "ingest00-dfs-data-landing-link-sbox"
      ~ tags                  = {
          - "application"  = "dlrm-data-ingest"
          - "builtFrom"    = "hmcts/dlrm-data-ingest-infra"
          - "businessArea" = "cross-cutting"
          - "criticality"  = "Low"
          - "environment"  = "sandbox"
          - "expiresAfter" = "2023-11-09"
        } -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # module.data_landing_zone["00"].azurerm_private_dns_zone_virtual_network_link.data_landing_link["privatelink.mysql.database.azure.com"] will be updated in-place
  ~ resource "azurerm_private_dns_zone_virtual_network_link" "data_landing_link" {
        id                    = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/core-infra-intsvc-rg/providers/Microsoft.Network/privateDnsZones/privatelink.mysql.database.azure.com/virtualNetworkLinks/ingest00-mysql-data-landing-link-sbox"
        name                  = "ingest00-mysql-data-landing-link-sbox"
      ~ tags                  = {
          - "application"  = "dlrm-data-ingest"
          - "builtFrom"    = "hmcts/dlrm-data-ingest-infra"
          - "businessArea" = "cross-cutting"
          - "criticality"  = "Low"
          - "environment"  = "sandbox"
          - "expiresAfter" = "2023-11-09"
        } -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # module.data_landing_zone["00"].azurerm_private_dns_zone_virtual_network_link.data_landing_link["privatelink.vaultcore.azure.net"] will be updated in-place
  ~ resource "azurerm_private_dns_zone_virtual_network_link" "data_landing_link" {
        id                    = "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/core-infra-intsvc-rg/providers/Microsoft.Network/privateDnsZones/privatelink.vaultcore.azure.net/virtualNetworkLinks/ingest00-vaultcore-data-landing-link-sbox"
        name                  = "ingest00-vaultcore-data-landing-link-sbox"
      ~ tags                  = {
          - "application"  = "dlrm-data-ingest"
          - "builtFrom"    = "hmcts/dlrm-data-ingest-infra"
          - "businessArea" = "cross-cutting"
          - "criticality"  = "Low"
          - "environment"  = "sandbox"
          - "expiresAfter" = "2023-11-09"
        } -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # module.data_landing_zone["00"].azurerm_resource_group.this["di001"] will be updated in-place
  ~ resource "azurerm_resource_group" "this" {
        id       = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/ingest00-di001-sbox"
        name     = "ingest00-di001-sbox"
      ~ tags     = {
          - "application"  = "dlrm-data-ingest"
          - "builtFrom"    = "hmcts/dlrm-data-ingest-infra"
          - "businessArea" = "cross-cutting"
          - "criticality"  = "Low"
          - "environment"  = "sandbox"
          - "expiresAfter" = "2023-11-09"
        } -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.data_landing_zone["00"].azurerm_resource_group.this["di002"] will be updated in-place
  ~ resource "azurerm_resource_group" "this" {
        id       = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/ingest00-di002-sbox"
        name     = "ingest00-di002-sbox"
      ~ tags     = {
          - "application"  = "dlrm-data-ingest"
          - "builtFrom"    = "hmcts/dlrm-data-ingest-infra"
          - "businessArea" = "cross-cutting"
          - "criticality"  = "Low"
          - "environment"  = "sandbox"
          - "expiresAfter" = "2023-11-09"
        } -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.data_landing_zone["00"].azurerm_resource_group.this["dp001"] will be updated in-place
  ~ resource "azurerm_resource_group" "this" {
        id       = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/ingest00-dp001-sbox"
        name     = "ingest00-dp001-sbox"
      ~ tags     = {
          - "application"  = "dlrm-data-ingest"
          - "builtFrom"    = "hmcts/dlrm-data-ingest-infra"
          - "businessArea" = "cross-cutting"
          - "criticality"  = "Low"
          - "environment"  = "sandbox"
          - "expiresAfter" = "2023-11-09"
        } -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.data_landing_zone["00"].azurerm_resource_group.this["dp002"] will be updated in-place
  ~ resource "azurerm_resource_group" "this" {
        id       = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/ingest00-dp002-sbox"
        name     = "ingest00-dp002-sbox"
      ~ tags     = {
          - "application"  = "dlrm-data-ingest"
          - "builtFrom"    = "hmcts/dlrm-data-ingest-infra"
          - "businessArea" = "cross-cutting"
          - "criticality"  = "Low"
          - "environment"  = "sandbox"
          - "expiresAfter" = "2023-11-09"
        } -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.data_landing_zone["00"].azurerm_resource_group.this["external-storage"] will be updated in-place
  ~ resource "azurerm_resource_group" "this" {
        id       = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/ingest00-external-storage-sbox"
        name     = "ingest00-external-storage-sbox"
      ~ tags     = {
          - "application"  = "dlrm-data-ingest"
          - "builtFrom"    = "hmcts/dlrm-data-ingest-infra"
          - "businessArea" = "cross-cutting"
          - "criticality"  = "Low"
          - "environment"  = "sandbox"
          - "expiresAfter" = "2023-11-09"
        } -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.data_landing_zone["00"].azurerm_resource_group.this["logging"] will be updated in-place
  ~ resource "azurerm_resource_group" "this" {
        id       = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/ingest00-logging-sbox"
        name     = "ingest00-logging-sbox"
      ~ tags     = {
          - "application"  = "dlrm-data-ingest"
          - "builtFrom"    = "hmcts/dlrm-data-ingest-infra"
          - "businessArea" = "cross-cutting"
          - "criticality"  = "Low"
          - "environment"  = "sandbox"
          - "expiresAfter" = "2023-11-09"
        } -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.data_landing_zone["00"].azurerm_resource_group.this["management"] will be updated in-place
  ~ resource "azurerm_resource_group" "this" {
        id       = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/ingest00-management-sbox"
        name     = "ingest00-management-sbox"
      ~ tags     = {
          - "application"  = "dlrm-data-ingest"
          - "builtFrom"    = "hmcts/dlrm-data-ingest-infra"
          - "businessArea" = "cross-cutting"
          - "criticality"  = "Low"
          - "environment"  = "sandbox"
          - "expiresAfter" = "2023-11-09"
        } -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.data_landing_zone["00"].azurerm_resource_group.this["metadata"] will be updated in-place
  ~ resource "azurerm_resource_group" "this" {
        id       = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/ingest00-metadata-sbox"
        name     = "ingest00-metadata-sbox"
      ~ tags     = {
          - "application"  = "dlrm-data-ingest"
          - "builtFrom"    = "hmcts/dlrm-data-ingest-infra"
          - "businessArea" = "cross-cutting"
          - "criticality"  = "Low"
          - "environment"  = "sandbox"
          - "expiresAfter" = "2023-11-09"
        } -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.data_landing_zone["00"].azurerm_resource_group.this["network"] will be updated in-place
  ~ resource "azurerm_resource_group" "this" {
        id       = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/ingest00-network-sbox"
        name     = "ingest00-network-sbox"
      ~ tags     = {
          - "application"  = "dlrm-data-ingest"
          - "builtFrom"    = "hmcts/dlrm-data-ingest-infra"
          - "businessArea" = "cross-cutting"
          - "criticality"  = "Low"
          - "environment"  = "sandbox"
          - "expiresAfter" = "2023-11-09"
        } -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.data_landing_zone["00"].azurerm_resource_group.this["runtimes"] will be updated in-place
  ~ resource "azurerm_resource_group" "this" {
        id       = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/ingest00-runtimes-sbox"
        name     = "ingest00-runtimes-sbox"
      ~ tags     = {
          - "application"  = "dlrm-data-ingest"
          - "builtFrom"    = "hmcts/dlrm-data-ingest-infra"
          - "businessArea" = "cross-cutting"
          - "criticality"  = "Low"
          - "environment"  = "sandbox"
          - "expiresAfter" = "2023-11-09"
        } -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.data_landing_zone["00"].azurerm_resource_group.this["shared-integration"] will be updated in-place
  ~ resource "azurerm_resource_group" "this" {
        id       = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/ingest00-shared-integration-sbox"
        name     = "ingest00-shared-integration-sbox"
      ~ tags     = {
          - "application"  = "dlrm-data-ingest"
          - "builtFrom"    = "hmcts/dlrm-data-ingest-infra"
          - "businessArea" = "cross-cutting"
          - "criticality"  = "Low"
          - "environment"  = "sandbox"
          - "expiresAfter" = "2023-11-09"
        } -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.data_landing_zone["00"].azurerm_resource_group.this["shared-product"] will be updated in-place
  ~ resource "azurerm_resource_group" "this" {
        id       = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/ingest00-shared-product-sbox"
        name     = "ingest00-shared-product-sbox"
      ~ tags     = {
          - "application"  = "dlrm-data-ingest"
          - "builtFrom"    = "hmcts/dlrm-data-ingest-infra"
          - "businessArea" = "cross-cutting"
          - "criticality"  = "Low"
          - "environment"  = "sandbox"
          - "expiresAfter" = "2023-11-09"
        } -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.data_landing_zone["00"].azurerm_resource_group.this["storage"] will be updated in-place
  ~ resource "azurerm_resource_group" "this" {
        id       = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/ingest00-storage-sbox"
        name     = "ingest00-storage-sbox"
      ~ tags     = {
          - "application"  = "dlrm-data-ingest"
          - "builtFrom"    = "hmcts/dlrm-data-ingest-infra"
          - "businessArea" = "cross-cutting"
          - "criticality"  = "Low"
          - "environment"  = "sandbox"
          - "expiresAfter" = "2023-11-09"
        } -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.data_landing_zone["00"].azurerm_role_assignment.datafactory_storage["curated"] will be created
  + resource "azurerm_role_assignment" "datafactory_storage" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "8860427c-27d7-45e2-bb1c-72ffdec9f0e2"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Blob Data Contributor"
      + scope                            = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/ingest00-storage-sbox/providers/Microsoft.Storage/storageAccounts/ingest00curatedsbox"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.data_landing_zone["00"].azurerm_role_assignment.datafactory_storage["raw"] will be created
  + resource "azurerm_role_assignment" "datafactory_storage" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "8860427c-27d7-45e2-bb1c-72ffdec9f0e2"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Storage Blob Data Contributor"
      + scope                            = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/ingest00-storage-sbox/providers/Microsoft.Storage/storageAccounts/ingest00rawsbox"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.data_landing_zone["00"].azurerm_storage_data_lake_gen2_filesystem.this["curated"] will be created
  + resource "azurerm_storage_data_lake_gen2_filesystem" "this" {
      + group              = (known after apply)
      + id                 = (known after apply)
      + name               = "ingest00-curated-sbox"
      + owner              = (known after apply)
      + storage_account_id = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/ingest00-storage-sbox/providers/Microsoft.Storage/storageAccounts/ingest00curatedsbox"
    }

  # module.data_landing_zone["00"].azurerm_storage_data_lake_gen2_filesystem.this["external"] will be created
  + resource "azurerm_storage_data_lake_gen2_filesystem" "this" {
      + group              = (known after apply)
      + id                 = (known after apply)
      + name               = "ingest00-external-sbox"
      + owner              = (known after apply)
      + storage_account_id = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/ingest00-external-storage-sbox/providers/Microsoft.Storage/storageAccounts/ingest00externalsbox"
    }

  # module.data_landing_zone["00"].azurerm_storage_data_lake_gen2_filesystem.this["raw"] will be created
  + resource "azurerm_storage_data_lake_gen2_filesystem" "this" {
      + group              = (known after apply)
      + id                 = (known after apply)
      + name               = "ingest00-raw-sbox"
      + owner              = (known after apply)
      + storage_account_id = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/ingest00-storage-sbox/providers/Microsoft.Storage/storageAccounts/ingest00rawsbox"
    }

  # module.data_landing_zone["00"].azurerm_storage_data_lake_gen2_filesystem.this["workspace"] will be created
  + resource "azurerm_storage_data_lake_gen2_filesystem" "this" {
      + group              = (known after apply)
      + id                 = (known after apply)
      + name               = "ingest00-workspace-sbox"
      + owner              = (known after apply)
      + storage_account_id = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/ingest00-storage-sbox/providers/Microsoft.Storage/storageAccounts/ingest00workspacesbox"
    }

  # module.data_landing_zone["00"].azurerm_storage_management_policy.this["curated"] will be created
  + resource "azurerm_storage_management_policy" "this" {
      + id                 = (known after apply)
      + storage_account_id = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/ingest00-storage-sbox/providers/Microsoft.Storage/storageAccounts/ingest00curatedsbox"

      + rule {
          + enabled = true
          + name    = "default"

          + actions {
              + base_blob {
                  + delete_after_days_since_creation_greater_than                  = -1
                  + delete_after_days_since_last_access_time_greater_than          = -1
                  + delete_after_days_since_modification_greater_than              = -1
                  + tier_to_archive_after_days_since_creation_greater_than         = -1
                  + tier_to_archive_after_days_since_last_access_time_greater_than = -1
                  + tier_to_archive_after_days_since_last_tier_change_greater_than = -1
                  + tier_to_archive_after_days_since_modification_greater_than     = -1
                  + tier_to_cool_after_days_since_creation_greater_than            = -1
                  + tier_to_cool_after_days_since_last_access_time_greater_than    = -1
                  + tier_to_cool_after_days_since_modification_greater_than        = 90
                }
              + snapshot {
                  + change_tier_to_archive_after_days_since_creation               = -1
                  + change_tier_to_cool_after_days_since_creation                  = 90
                  + delete_after_days_since_creation_great

# ...
# ... The maximum length of GitHub Comment is 65536, so the content is omitted by tfcmt.
# ...

ity/datascanners/storageDataScanner" -> null
              - endpoint_tenant_id   = "531ff96d-0ae9-462a-8d2d-bec7c0b42082" -> null
            }
        }

        # (3 unchanged blocks hidden)
    }

  # module.data_landing_zone["00"].module.storage["workspace"].azurerm_storage_container.container["data"] will be created
  + resource "azurerm_storage_container" "container" {
      + container_access_type   = "private"
      + has_immutability_policy = (known after apply)
      + has_legal_hold          = (known after apply)
      + id                      = (known after apply)
      + metadata                = (known after apply)
      + name                    = "data"
      + resource_manager_id     = (known after apply)
      + storage_account_name    = "ingest00workspacesbox"
    }

  # module.data_landing_zone["00"].module.storage["workspace"].azurerm_storage_container.container["dp001"] will be created
  + resource "azurerm_storage_container" "container" {
      + container_access_type   = "private"
      + has_immutability_policy = (known after apply)
      + has_legal_hold          = (known after apply)
      + id                      = (known after apply)
      + metadata                = (known after apply)
      + name                    = "dp001"
      + resource_manager_id     = (known after apply)
      + storage_account_name    = "ingest00workspacesbox"
    }

  # module.data_landing_zone["00"].module.storage["workspace"].azurerm_storage_container.container["dp002"] will be created
  + resource "azurerm_storage_container" "container" {
      + container_access_type   = "private"
      + has_immutability_policy = (known after apply)
      + has_legal_hold          = (known after apply)
      + id                      = (known after apply)
      + metadata                = (known after apply)
      + name                    = "dp002"
      + resource_manager_id     = (known after apply)
      + storage_account_name    = "ingest00workspacesbox"
    }

  # module.data_landing_zone["00"].module.storage_pe["curated-blob"].azurerm_private_endpoint.this will be created
  + resource "azurerm_private_endpoint" "this" {
      + custom_dns_configs       = (known after apply)
      + id                       = (known after apply)
      + location                 = "uksouth"
      + name                     = "ingest00-curated-blob-pe-sbox"
      + network_interface        = (known after apply)
      + private_dns_zone_configs = (known after apply)
      + resource_group_name      = "ingest00-storage-sbox"
      + subnet_id                = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/ingest00-network-sbox/providers/Microsoft.Network/virtualNetworks/ingest00-vnet-sbox/subnets/ingest00-services-sbox"
      + tags                     = (known after apply)

      + private_dns_zone_group {
          + id                   = (known after apply)
          + name                 = "endpoint-dnszonegroup"
          + private_dns_zone_ids = [
              + "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/core-infra-intsvc-rg/providers/Microsoft.Network/privateDnsZones/privatelink.blob.core.windows.net",
            ]
        }

      + private_service_connection {
          + is_manual_connection           = false
          + name                           = "ingest00curatedsbox"
          + private_connection_resource_id = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/ingest00-storage-sbox/providers/Microsoft.Storage/storageAccounts/ingest00curatedsbox"
          + private_ip_address             = (known after apply)
          + subresource_names              = [
              + "blob",
            ]
        }
    }

  # module.data_landing_zone["00"].module.storage_pe["curated-dfs"].azurerm_private_endpoint.this will be created
  + resource "azurerm_private_endpoint" "this" {
      + custom_dns_configs       = (known after apply)
      + id                       = (known after apply)
      + location                 = "uksouth"
      + name                     = "ingest00-curated-dfs-pe-sbox"
      + network_interface        = (known after apply)
      + private_dns_zone_configs = (known after apply)
      + resource_group_name      = "ingest00-storage-sbox"
      + subnet_id                = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/ingest00-network-sbox/providers/Microsoft.Network/virtualNetworks/ingest00-vnet-sbox/subnets/ingest00-services-sbox"
      + tags                     = (known after apply)

      + private_dns_zone_group {
          + id                   = (known after apply)
          + name                 = "endpoint-dnszonegroup"
          + private_dns_zone_ids = [
              + "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/core-infra-intsvc-rg/providers/Microsoft.Network/privateDnsZones/privatelink.dfs.core.windows.net",
            ]
        }

      + private_service_connection {
          + is_manual_connection           = false
          + name                           = "ingest00curatedsbox"
          + private_connection_resource_id = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/ingest00-storage-sbox/providers/Microsoft.Storage/storageAccounts/ingest00curatedsbox"
          + private_ip_address             = (known after apply)
          + subresource_names              = [
              + "dfs",
            ]
        }
    }

  # module.data_landing_zone["00"].module.storage_pe["external-blob"].azurerm_private_endpoint.this will be created
  + resource "azurerm_private_endpoint" "this" {
      + custom_dns_configs       = (known after apply)
      + id                       = (known after apply)
      + location                 = "uksouth"
      + name                     = "ingest00-external-blob-pe-sbox"
      + network_interface        = (known after apply)
      + private_dns_zone_configs = (known after apply)
      + resource_group_name      = "ingest00-external-storage-sbox"
      + subnet_id                = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/ingest00-network-sbox/providers/Microsoft.Network/virtualNetworks/ingest00-vnet-sbox/subnets/ingest00-services-sbox"
      + tags                     = (known after apply)

      + private_dns_zone_group {
          + id                   = (known after apply)
          + name                 = "endpoint-dnszonegroup"
          + private_dns_zone_ids = [
              + "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/core-infra-intsvc-rg/providers/Microsoft.Network/privateDnsZones/privatelink.blob.core.windows.net",
            ]
        }

      + private_service_connection {
          + is_manual_connection           = false
          + name                           = "ingest00externalsbox"
          + private_connection_resource_id = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/ingest00-external-storage-sbox/providers/Microsoft.Storage/storageAccounts/ingest00externalsbox"
          + private_ip_address             = (known after apply)
          + subresource_names              = [
              + "blob",
            ]
        }
    }

  # module.data_landing_zone["00"].module.storage_pe["external-dfs"].azurerm_private_endpoint.this will be created
  + resource "azurerm_private_endpoint" "this" {
      + custom_dns_configs       = (known after apply)
      + id                       = (known after apply)
      + location                 = "uksouth"
      + name                     = "ingest00-external-dfs-pe-sbox"
      + network_interface        = (known after apply)
      + private_dns_zone_configs = (known after apply)
      + resource_group_name      = "ingest00-external-storage-sbox"
      + subnet_id                = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/ingest00-network-sbox/providers/Microsoft.Network/virtualNetworks/ingest00-vnet-sbox/subnets/ingest00-services-sbox"
      + tags                     = (known after apply)

      + private_dns_zone_group {
          + id                   = (known after apply)
          + name                 = "endpoint-dnszonegroup"
          + private_dns_zone_ids = [
              + "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/core-infra-intsvc-rg/providers/Microsoft.Network/privateDnsZones/privatelink.dfs.core.windows.net",
            ]
        }

      + private_service_connection {
          + is_manual_connection           = false
          + name                           = "ingest00externalsbox"
          + private_connection_resource_id = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/ingest00-external-storage-sbox/providers/Microsoft.Storage/storageAccounts/ingest00externalsbox"
          + private_ip_address             = (known after apply)
          + subresource_names              = [
              + "dfs",
            ]
        }
    }

  # module.data_landing_zone["00"].module.storage_pe["raw-blob"].azurerm_private_endpoint.this will be created
  + resource "azurerm_private_endpoint" "this" {
      + custom_dns_configs       = (known after apply)
      + id                       = (known after apply)
      + location                 = "uksouth"
      + name                     = "ingest00-raw-blob-pe-sbox"
      + network_interface        = (known after apply)
      + private_dns_zone_configs = (known after apply)
      + resource_group_name      = "ingest00-storage-sbox"
      + subnet_id                = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/ingest00-network-sbox/providers/Microsoft.Network/virtualNetworks/ingest00-vnet-sbox/subnets/ingest00-services-sbox"
      + tags                     = (known after apply)

      + private_dns_zone_group {
          + id                   = (known after apply)
          + name                 = "endpoint-dnszonegroup"
          + private_dns_zone_ids = [
              + "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/core-infra-intsvc-rg/providers/Microsoft.Network/privateDnsZones/privatelink.blob.core.windows.net",
            ]
        }

      + private_service_connection {
          + is_manual_connection           = false
          + name                           = "ingest00rawsbox"
          + private_connection_resource_id = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/ingest00-storage-sbox/providers/Microsoft.Storage/storageAccounts/ingest00rawsbox"
          + private_ip_address             = (known after apply)
          + subresource_names              = [
              + "blob",
            ]
        }
    }

  # module.data_landing_zone["00"].module.storage_pe["raw-dfs"].azurerm_private_endpoint.this will be created
  + resource "azurerm_private_endpoint" "this" {
      + custom_dns_configs       = (known after apply)
      + id                       = (known after apply)
      + location                 = "uksouth"
      + name                     = "ingest00-raw-dfs-pe-sbox"
      + network_interface        = (known after apply)
      + private_dns_zone_configs = (known after apply)
      + resource_group_name      = "ingest00-storage-sbox"
      + subnet_id                = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/ingest00-network-sbox/providers/Microsoft.Network/virtualNetworks/ingest00-vnet-sbox/subnets/ingest00-services-sbox"
      + tags                     = (known after apply)

      + private_dns_zone_group {
          + id                   = (known after apply)
          + name                 = "endpoint-dnszonegroup"
          + private_dns_zone_ids = [
              + "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/core-infra-intsvc-rg/providers/Microsoft.Network/privateDnsZones/privatelink.dfs.core.windows.net",
            ]
        }

      + private_service_connection {
          + is_manual_connection           = false
          + name                           = "ingest00rawsbox"
          + private_connection_resource_id = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/ingest00-storage-sbox/providers/Microsoft.Storage/storageAccounts/ingest00rawsbox"
          + private_ip_address             = (known after apply)
          + subresource_names              = [
              + "dfs",
            ]
        }
    }

  # module.data_landing_zone["00"].module.storage_pe["workspace-blob"].azurerm_private_endpoint.this will be created
  + resource "azurerm_private_endpoint" "this" {
      + custom_dns_configs       = (known after apply)
      + id                       = (known after apply)
      + location                 = "uksouth"
      + name                     = "ingest00-workspace-blob-pe-sbox"
      + network_interface        = (known after apply)
      + private_dns_zone_configs = (known after apply)
      + resource_group_name      = "ingest00-storage-sbox"
      + subnet_id                = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/ingest00-network-sbox/providers/Microsoft.Network/virtualNetworks/ingest00-vnet-sbox/subnets/ingest00-services-sbox"
      + tags                     = (known after apply)

      + private_dns_zone_group {
          + id                   = (known after apply)
          + name                 = "endpoint-dnszonegroup"
          + private_dns_zone_ids = [
              + "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/core-infra-intsvc-rg/providers/Microsoft.Network/privateDnsZones/privatelink.blob.core.windows.net",
            ]
        }

      + private_service_connection {
          + is_manual_connection           = false
          + name                           = "ingest00workspacesbox"
          + private_connection_resource_id = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/ingest00-storage-sbox/providers/Microsoft.Storage/storageAccounts/ingest00workspacesbox"
          + private_ip_address             = (known after apply)
          + subresource_names              = [
              + "blob",
            ]
        }
    }

  # module.data_landing_zone["00"].module.storage_pe["workspace-dfs"].azurerm_private_endpoint.this will be created
  + resource "azurerm_private_endpoint" "this" {
      + custom_dns_configs       = (known after apply)
      + id                       = (known after apply)
      + location                 = "uksouth"
      + name                     = "ingest00-workspace-dfs-pe-sbox"
      + network_interface        = (known after apply)
      + private_dns_zone_configs = (known after apply)
      + resource_group_name      = "ingest00-storage-sbox"
      + subnet_id                = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/ingest00-network-sbox/providers/Microsoft.Network/virtualNetworks/ingest00-vnet-sbox/subnets/ingest00-services-sbox"
      + tags                     = (known after apply)

      + private_dns_zone_group {
          + id                   = (known after apply)
          + name                 = "endpoint-dnszonegroup"
          + private_dns_zone_ids = [
              + "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/core-infra-intsvc-rg/providers/Microsoft.Network/privateDnsZones/privatelink.dfs.core.windows.net",
            ]
        }

      + private_service_connection {
          + is_manual_connection           = false
          + name                           = "ingest00workspacesbox"
          + private_connection_resource_id = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/ingest00-storage-sbox/providers/Microsoft.Storage/storageAccounts/ingest00workspacesbox"
          + private_ip_address             = (known after apply)
          + subresource_names              = [
              + "dfs",
            ]
        }
    }

  # module.data_landing_zone["00"].module.shir001.module.shir_vmss.azurerm_windows_virtual_machine_scale_set.windows_scale_set[0] will be created
  + resource "azurerm_windows_virtual_machine_scale_set" "windows_scale_set" {
      + admin_password                                    = (sensitive value)
      + admin_username                                    = "VMAdmin"
      + computer_name_prefix                              = "shir001"
      + do_not_run_extensions_on_overprovisioned_machines = false
      + enable_automatic_updates                          = true
      + extension_operations_enabled                      = (known after apply)
      + extensions_time_budget                            = "PT1H30M"
      + id                                                = (known after apply)
      + instances                                         = 1
      + location                                          = "uksouth"
      + max_bid_price                                     = -1
      + name                                              = "ingest00-shir001-vmss"
      + overprovision                                     = true
      + platform_fault_domain_count                       = (known after apply)
      + priority                                          = "Regular"
      + provision_vm_agent                                = true
      + resource_group_name                               = "ingest00-runtimes-sbox"
      + scale_in_policy                                   = (known after apply)
      + single_placement_group                            = true
      + sku                                               = "Standard_D4ds_v5"
      + unique_id                                         = (known after apply)
      + upgrade_mode                                      = "Manual"
      + zone_balance                                      = false
      + zones                                             = [
          + "1",
        ]

      + identity {
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "SystemAssigned"
        }

      + network_interface {
          + enable_accelerated_networking = false
          + enable_ip_forwarding          = false
          + name                          = "ingest00-shir001-nic"
          + primary                       = true

          + ip_configuration {
              + load_balancer_backend_address_pool_ids = [
                  + "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/ingest00-runtimes-sbox/providers/Microsoft.Network/loadBalancers/ingest00-shir001-lb-sbox/backendAddressPools/ingest00-shir001",
                ]
              + load_balancer_inbound_nat_rules_ids    = [
                  + "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/ingest00-runtimes-sbox/providers/Microsoft.Network/loadBalancers/ingest00-shir001-lb-sbox/inboundNatPools/ingest00-shir001-natpool-sbox",
                ]
              + name                                   = "ingest00-shir001-ipconfig"
              + primary                                = true
              + subnet_id                              = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/ingest00-network-sbox/providers/Microsoft.Network/virtualNetworks/ingest00-vnet-sbox/subnets/ingest00-services-sbox"
              + version                                = "IPv4"
            }
        }

      + os_disk {
          + caching                   = "ReadWrite"
          + disk_size_gb              = (known after apply)
          + storage_account_type      = "StandardSSD_LRS"
          + write_accelerator_enabled = false
        }

      + source_image_reference {
          + offer     = "WindowsServer"
          + publisher = "MicrosoftWindowsServer"
          + sku       = "2022-datacenter-azure-edition"
          + version   = "latest"
        }
    }

Plan: 32 to add, 54 to change, 0 to destroy.
```

</details>



<details><summary>:information_source: Objects have changed outside of Terraform</summary>

_This feature was introduced from [Terraform v0.15.4](https://github.com/hashicorp/terraform/releases/tag/v0.15.4)._

```hcl

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.data_landing_zone["00"].module.runtimes_datafactory.azurerm_data_factory.this has changed
  ~ resource "azurerm_data_factory" "this" {
        id                              = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/ingest00-runtimes-sbox/providers/Microsoft.DataFactory/factories/ingest00-runtimes-dataFactory001-sbox"
        name                            = "ingest00-runtimes-dataFactory001-sbox"
        tags                            = {
            "application"  = "dlrm-data-ingest"
            "builtFrom"    = "hmcts/dlrm-data-ingest-infra"
            "businessArea" = "cross-cutting"
            "criticality"  = "Low"
            "environment"  = "sandbox"
            "expiresAfter" = "2023-11-09"
        }
        # (5 unchanged attributes hidden)

      ~ identity {
          + identity_ids = []
            # (3 unchanged attributes hidden)
        }
    }

  # module.data_landing_zone["00"].module.shared_integration_datafactory.azurerm_data_factory.this has changed
  ~ resource "azurerm_data_factory" "this" {
        id                              = "/subscriptions/a8140a9e-f1b0-481f-a4de-09e2ee23f7ab/resourceGroups/ingest00-shared-integration-sbox/providers/Microsoft.DataFactory/factories/ingest00-integration-dataFactory001-sbox"
        name                            = "ingest00-integration-dataFactory001-sbox"
        tags                            = {
            "application"  = "dlrm-data-ingest"
            "builtFrom"    = "hmcts/dlrm-data-ingest-infra"
            "businessArea" = "cross-cutting"
            "criticality"  = "Low"
            "environment"  = "sandbox"
            "expiresAfter" = "2023-11-09"
        }
        # (5 unchanged attributes hidden)

      ~ identity {
          + identity_ids = []
            # (3 unchanged attributes hidden)
        }
    }


Unless you have made equivalent changes to your configuration, or ignored the
```

</details>



<!-- github-comment: {"Command":"plan","PRNumber":7,"Program":"tfcmt","SHA1":"","Target":"sbox_landing","Vars":{}} -->